In [71]:
import pandas as pd
import numpy as np

[문1] 아래 조건을 만족하는 Series를 생성하세요.
1) 데이터 : 1~50 범위에서 7의 배수 정수
2) 인덱스 : 'a~z' 범위에서 데이터 갯수 만큼의 알파벳
3) 타  입 : 부호가 없는 1바이트 정수
4) 이  름 : sevens
5) 속  성 : index, values, dtype, ndim, shape, size

In [160]:
seven = {'a':7, 'b':14, 'c':21, 'd':28, 'e':35, 'f':42, 'g':49}
sevens =pd.Series(seven)
print(sevens.index, sevens.values, sevens.dtype, 
      sevens.ndim, sevens.shape, sevens.size, sep='\n\n')

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

[ 7 14 21 28 35 42 49]

int64

1

(7,)

7

[문2] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : knu_data.csv
2) 인덱스 : 컬럼 중 하나를 인덱스로 설정
3) 속성 정보 출력 
4) 데이터 확인 정보 출력
5) 타입과 실제 데이터 타입 일치

In [73]:
file='../EXAM_PANDAS/DATA/knu_data.csv'

In [74]:
knuDF = pd.read_csv(file)

In [75]:
knuDF

   mem_id    team            time
0  knu_21   경영지원팀  20231102200000
1  knu_03   대외협력팀  20231117200000
2  knu_01   대외협력팀  20231109200000
3  knu_09   경영지원팀  20221122200000
4  knu_01   경영지원팀  20221111200000

In [76]:
knuDF.index, knuDF.columns

(RangeIndex(start=0, stop=5, step=1),
 Index(['mem_id', 'team', 'time'], dtype='object'))

In [77]:
knuDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mem_id  5 non-null      object
 1   team    5 non-null      object
 2   time    5 non-null      int64
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

[문3] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : stats_100701.xlsx
2) 년도별 인구가 가장 많은 지역과 가장 적은 지역 
3) 6대 광역시에서 년도별 인구가 가장 많은 지역과 가장 적은 지역 
4) 8도 중 7도에서 년도별 인구가 가장 많은 지역과 가장 적은 지역

In [78]:
file='../EXAM_PANDAS/DATA/stats_100701.xlsx'

In [79]:
statsDF = pd.read_excel(file)

In [80]:
statsDF

   지역별 인구  [단위 : 천명, 명/㎢]  Unnamed: 1  Unnamed: 2  Unnamed: 3  Unnamed: 4
0                     NaN        2015        2016        2017        2018
1                       계       51015       51218       51362       51607
2                      서울        9941        9843        9766        9705
3                      부산        3452        3447        3424        3400
4                      대구        2469        2461        2458        2450
5                      인천        2883        2907        2924        2939
6                      광주        1506        1502        1495        1493
7                      대전        1542        1536        1528        1518
8                      울산        1164        1166        1159        1154
9                      세종         187         234         266         304
10                     경기       12423       12600       12786       13031
11                     강원        1517        1521        1521        1521
12                     충북        1589        1601        1609        1619
13                     충남        2103        2126        2153        2180
14                     전북        1835        1835        1829        1820
15                     전남        1797        1798        1795        1790
16                     경북        2678        2683        2675        2674
17                     경남        3330        3338        3339        3356
18                     제주         599         618         635         653
19                    수도권       25247       25350       25476       25675

[문4] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : stock price.xlsx
2) 데이터 로딩 시 인덱스로 사용할 수 있는 컬럼 설정
3) 결측치 처리 =>
   (가) 1개라도 NaN이면 모두 제거 / price가 NaN이면 제거 / value가 10000이하면 제거
   (나) 평균값으로 결측치 대체, 이전/이후 값으로 결측치 대체
4) value가 1000이하 이거나 price가 90000이상인 데이터

In [81]:
file = '../EXAM_PANDAS/DATA/stock price.xlsx'

In [82]:
stockDF = pd.read_excel(file)

In [83]:
stockDF

        id stock_name          value     price
0   128940       한미약품   59385.666667  421000.0
1   138040    메리츠금융지주     827.500000       NaN
2   130960     CJ E&M   58540.666667   98900.0
3   138250      엔에스쇼핑   14558.666667   13200.0
4   139480        이마트  239230.833333  254500.0
5   142280     녹십자엠에스     468.833333   10200.0
6   145990        삼양사   82750.000000   82000.0
7   181710  NHN엔터테인먼트            NaN       NaN
8   185750        종근당   40293.666667  100500.0
9   192400      쿠쿠홀딩스  179204.666667  177500.0
10  199800         툴젠   -2514.333333  115400.0
11  204210     모두투어리츠    3093.333333    3475.0
12  207940   삼성바이오로직스            NaN   91900.0

In [151]:
if stockDF['price'] == np.nan:
    print(stockDF)
elif stockDF['price'] == np.nan:
    print(stockDF)
elif stockDF['value'] <= 10000: 
    print(stockDF)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [115]:
print(stockDF.ffill(), stockDF.bfill(), sep='\n\n')

        id stock_name          value     price
0   128940       한미약품   59385.666667  421000.0
1   138040    메리츠금융지주     827.500000  421000.0
2   130960     CJ E&M   58540.666667   98900.0
3   138250      엔에스쇼핑   14558.666667   13200.0
4   139480        이마트  239230.833333  254500.0
5   142280     녹십자엠에스     468.833333   10200.0
6   145990        삼양사   82750.000000   82000.0
7   181710  NHN엔터테인먼트   82750.000000   82000.0
8   185750        종근당   40293.666667  100500.0
9   192400      쿠쿠홀딩스  179204.666667  177500.0
10  199800         툴젠   -2514.333333  115400.0
11  204210     모두투어리츠    3093.333333    3475.0
12  207940   삼성바이오로직스    3093.333333   91900.0

        id stock_name          value     price
0   128940       한미약품   59385.666667  421000.0
1   138040    메리츠금융지주     827.500000   98900.0
2   130960     CJ E&M   58540.666667   98900.0
3   138250      엔에스쇼핑   14558.666667   13200.0
4   139480        이마트  239230.833333  254500.0
5   142280     녹십자엠에스     468.833333   10200.0
6   145990        삼양사   82750.000000   82000.0
7   181710  NHN엔터테인먼트   40293.666667  100500.0
8   185750        종근당   40293.666667  100500.0
9   192400      쿠쿠홀딩스  179204.666667  177500.0
10  199800         툴젠   -2514.333333  115400.0
11  204210     모두투어리츠    3093.333333    3475.0
12  207940   삼성바이오로직스            NaN   91900.0

In [84]:
# 4-4 문제
(stockDF['value'] < 1000) | (stockDF['price'] >= 90000)

0      True
1      True
2      True
3     False
4      True
5      True
6     False
7     False
8      True
9      True
10     True
11    False
12     True
dtype: bool